app/controllers/school_classes_controller.rb

SELECT  "schools_classes".* FROM "schools_classes" WHERE "schools_classes"."id" = ? LIMIT 1  [["id", 1]]
---
 def set_school_class

 @school_class = SchoolsClass.find(params[:id])